data/2023_08_22/read_write_split_disable_4_with_read_pct_80/test-vtgate-run-80-20-16-time-2023-08-22-19-26.txt
run sysbench
check mysql database exists
mysql host 172.16.251.240 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.251.240 --mysql-port=15306 --mysql-user=root --mysql-password=123456 --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=16 --events=0 --percentile=99 --read-percent=80 --write-percent=20 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 16 tps: 79.89 qps: 8620.90 (r/w/o: 7023.15/1597.76/0.00) lat (ms,99%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 16 tps: 80.05 qps: 8329.02 (r/w/o: 6720.05/1608.97/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 16 tps: 79.00 qps: 7501.02 (r/w/o: 5909.02/1592.00/0.00) lat (ms,99%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 16 tps: 67.00 qps: 7276.94 (r/w/o: 5893.96/1382.99/0.00) lat (ms,99%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 16 tps: 65.00 qps: 6627.04 (r/w/o: 5271.03/1356.01/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 16 tps: 76.00 qps: 6884.99 (r/w/o: 5448.99/1436.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 16 tps: 54.00 qps: 6125.04 (r/w/o: 4910.03/1215.01/0.00) lat (ms,99%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 16 tps: 72.00 qps: 6702.99 (r/w/o: 5348.99/1354.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 16 tps: 70.00 qps: 6879.01 (r/w/o: 5548.01/1331.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 65.00 qps: 6866.98 (r/w/o: 5547.98/1319.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 16 tps: 67.00 qps: 6695.99 (r/w/o: 5367.99/1328.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 16 tps: 64.00 qps: 6586.00 (r/w/o: 5238.00/1348.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 16 tps: 69.96 qps: 6363.15 (r/w/o: 5043.95/1319.20/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 16 tps: 63.04 qps: 6664.00 (r/w/o: 5335.21/1328.80/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 67.00 qps: 6715.03 (r/w/o: 5400.03/1315.01/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 16 tps: 65.00 qps: 6629.96 (r/w/o: 5321.97/1307.99/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 16 tps: 64.00 qps: 6446.89 (r/w/o: 5143.92/1302.98/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 16 tps: 68.00 qps: 6652.07 (r/w/o: 5314.06/1338.01/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 16 tps: 68.00 qps: 6792.91 (r/w/o: 5446.93/1345.98/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 65.00 qps: 6414.17 (r/w/o: 5116.14/1298.03/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 16 tps: 65.00 qps: 6316.02 (r/w/o: 5025.02/1291.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 16 tps: 66.00 qps: 6591.96 (r/w/o: 5294.96/1296.99/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 16 tps: 65.00 qps: 6819.86 (r/w/o: 5508.89/1310.97/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 16 tps: 64.00 qps: 6715.02 (r/w/o: 5379.02/1336.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 66.00 qps: 6447.08 (r/w/o: 5139.06/1308.02/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 16 tps: 65.00 qps: 6559.05 (r/w/o: 5209.04/1350.01/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 16 tps: 69.00 qps: 6536.01 (r/w/o: 5210.01/1326.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 16 tps: 63.00 qps: 6501.88 (r/w/o: 5207.90/1293.98/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 16 tps: 70.00 qps: 6703.99 (r/w/o: 5346.00/1358.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 68.00 qps: 6678.13 (r/w/o: 5355.10/1323.03/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 16 tps: 55.00 qps: 6212.98 (r/w/o: 4965.98/1247.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 16 tps: 74.00 qps: 6838.92 (r/w/o: 5463.94/1374.98/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 16 tps: 65.00 qps: 6706.07 (r/w/o: 5377.06/1329.01/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 16 tps: 69.00 qps: 6659.01 (r/w/o: 5337.01/1322.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 66.00 qps: 6650.01 (r/w/o: 5346.01/1304.00/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 16 tps: 64.00 qps: 6844.94 (r/w/o: 5508.95/1335.99/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 16 tps: 67.00 qps: 6694.02 (r/w/o: 5281.01/1413.00/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 16 tps: 66.00 qps: 6543.99 (r/w/o: 5251.99/1292.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 16 tps: 69.00 qps: 6752.07 (r/w/o: 5399.05/1353.01/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 65.00 qps: 6456.99 (r/w/o: 5148.99/1308.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 16 tps: 71.00 qps: 6860.02 (r/w/o: 5508.02/1352.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 16 tps: 61.00 qps: 6551.81 (r/w/o: 5251.84/1299.96/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 16 tps: 69.00 qps: 6825.17 (r/w/o: 5430.14/1395.04/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 16 tps: 68.00 qps: 6546.99 (r/w/o: 5228.99/1318.00/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 70.00 qps: 6622.96 (r/w/o: 5296.97/1325.99/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 16 tps: 63.00 qps: 6619.03 (r/w/o: 5322.02/1297.01/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 16 tps: 64.00 qps: 6459.01 (r/w/o: 5194.01/1265.00/0.00) lat (ms,99%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 16 tps: 65.00 qps: 6693.01 (r/w/o: 5393.00/1300.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 16 tps: 68.00 qps: 6624.80 (r/w/o: 5240.84/1383.96/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 66.00 qps: 6617.08 (r/w/o: 5300.06/1317.02/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 16 tps: 64.00 qps: 6711.09 (r/w/o: 5401.07/1310.02/0.00) lat (ms,99%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 16 tps: 64.00 qps: 6312.02 (r/w/o: 5040.02/1272.00/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 16 tps: 66.00 qps: 6500.01 (r/w/o: 5159.01/1341.00/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 16 tps: 67.00 qps: 6501.00 (r/w/o: 5193.00/1308.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 63.00 qps: 6517.01 (r/w/o: 5223.01/1294.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 16 tps: 68.00 qps: 6733.86 (r/w/o: 5353.88/1379.97/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 16 tps: 65.00 qps: 6549.14 (r/w/o: 5237.11/1312.03/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 16 tps: 72.00 qps: 6740.00 (r/w/o: 5411.00/1329.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 16 tps: 64.00 qps: 6966.99 (r/w/o: 5650.99/1316.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 66.00 qps: 6558.01 (r/w/o: 5229.01/1329.00/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            322400
        write:                           80600
        other:                           0
        total:                           403000
    transactions:                        4030   (66.99 per sec.)
    queries:                             403000 (6698.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.1603s
    total number of events:              4030

Latency (ms):
         min:                                  159.87
         avg:                                  238.58
         max:                                  305.13
         99th percentile:                      282.25
         sum:                               961486.18

Threads fairness:
    events (avg/stddev):           251.8750/1.11
    execution time (avg/stddev):   60.0929/0.04